// кастомный договор с изменениями
import React from 'react';
import cn from 'classnames';
import { Card, Button } from 'antd';
import style from './OnlineContract.module.scss';
import LogoFrame from './LogoFrame';

const OnlineContractUshakov = ({ pdfData, url }) => {
	return (
		<div className={style.container}>
			<Card>
				<div className={style.wrapper}>
					<LogoFrame />
					<h1 className={style.title}>договор-оферта на оказание услуг</h1>
					<p className={cn(style.text, style.bold)}>1. Общие положения</p>
					<p className={style.text}>
						1.1. Настоящий договор (далее – «Договор») представляет собой
						официальное предложение{' '}
						<strong>
							Индивидуального предпринимателя Ушакова Павла Валерьевича
						</strong>{' '}
						далее именуемый «Исполнитель», по оказанию Услуг юридическим лицам и
						индивидуальным предпринимателям без образования юридического лица,
						признаваемым «Заказчиками» в соответствии с условиями Договора.
					</p>
					<p className={style.text}>
						1.2. Исполнитель и Заказчик для целей настоящего Договора далее
						совместно именуются «Стороны».
					</p>
					<p className={style.text}>
						1.3. В соответствии с пунктом 1 статьи 435 Гражданского кодекса
						Российской Федерации (далее – ГК РФ) данный документ является
						простой Офертой. Акцепт Оферты производится путем оплаты счета
						выставленного Исполнителем. В случае оплаты услуг Исполнителя по
						счету, выставленному Исполнителем, лицо, осуществившее Акцепт
						настоящей Оферты, становится Заказчиком. Существенные условия
						Договора содержатся в самом Договоре и приложениях к нему в виде
						Приложения №1 и счетов на оплату, выставляемых Исполнителем.
					</p>
					<p className={style.text}>
						1.4. Настоящий договор считается подписанным с момента оплаты
						первого счета по Договору.
					</p>
					<p className={style.text}>
						1.5. В соответствии с пунктом 1 статьи 438 ГК РФ Акцепт должен быть
						полным и безоговорочным.
					</p>
					<p className={style.text}>
						1.6. В соответствии с пунктом 3 статьи 438 ГК РФ совершение лицом,
						получившим Оферту, в срок, установленный для ее акцепта (5 рабочих
						дней), действий по выполнению указанных в ней условий Договора
						считается акцептом настоящей Оферты.
					</p>
					<p className={style.text}>
						1.7. Исполнитель и Заказчик предоставляют взаимные гарантии своей
						право- и дееспособности, необходимые для заключения и исполнения
						настоящего Договора.
					</p>
					<p className={cn(style.text, style.bold)}>
						2. Предмет и общие условия договора
					</p>
					<p className={style.text}>
						2.1. В соответствии с настоящим договором Исполнитель обязуется по
						заданию Заказчика выполнить оказать услуги, а Заказчик обязуется
						оплатить эти работы услуги. Вид, объём и порядок оказания услуг
						устанавливается на основании Приложения №1 «Коммерческое
						предложение» подписываемого Исполнителем. Существенные условия
						Договора определяются в Приложении №1, которое согласовывается с
						Заказчиком путем переговоров и направляется Заказчику в любом
						удобном формате связи.
					</p>
					<p className={style.text}>
						2.2. Местом выполнения услуги является объект Заказчика (далее –
						Объект), определенный в Приложении № 1. Стороны согласовали
						возможность оказания Услуг в местах, отличных от указанного в
						настоящем пункте Договора.
					</p>
					<p className={style.text}>
						2.3. Для оказания услуг Исполнитель вправе без согласования с
						Заказчиком привлекать третьих лиц, отвечающих требованиям опыта и
						квалификации. Вместе с тем, ответственность за качество и сроки
						выполнения работ перед Заказчиком несет Исполнитель.
					</p>
					<p className={style.text}>
						2.4. Услуги по настоящему Договору оказываются на основании
						оплаченного Заказчиком счета. Реквизиты и идентификаторы сторон
						заполняются в выставляемых счетах. В случае полной оплаты Заказчиком
						периода оказания услуг, следующего за оплаченным периодом, Договор
						считается автоматически продленным на срок оплаченного периода.
						Количество продлений действия Заявки ограничено лишь сроком действия
						настоящего Договора.
					</p>
					<p className={style.text}>
						2.5. В случае неоплаты Заказчиком счета на следующий период (месяц)
						при отсутствии уведомления от Заказчика об отказе (прекращении) от
						Договора, приостановлении действия Договора, при отсутствии также
						письменного несогласия Заказчика с условиями Договора, Исполнитель
						вправе приостановить оказание услуг. Если в течение 5 рабочих дней
						Заказчиком не будет произведена оплата по выставленному счету,
						Исполнитель вправе прекратить исполнение услуги по Договору, при
						условии, если, согласно выставленному счету, Исполнителем
						оказывается две или более услуг. Если согласно выставленному счету
						Исполнителем оказывается одна услуга, то в случае неоплаты
						Заказчиком счета на следующий период, Исполнитель вправе расторгнуть
						договор в одностороннем порядке.
					</p>
					<p className={cn(style.text, style.bold)}>
						3. Права и обязанности сторон
					</p>
					<p className={cn(style.text, style.bold)}>
						3.1. Исполнитель обязуется:
					</p>
					<p className={style.text}>
						3.1.1. Оказывать услуги качественно, в установленные сроки, и в
						полном объеме в соответствии с условиями Договора и видом
						оказываемых услуг.
					</p>
					<p className={style.text}>
						3.1.2. Информировать Заказчика о ходе оказания услуг по Договору.
					</p>
					<p className={style.text}>
						3.1.3. Сохранять конфиденциальность о деятельности Заказчика и
						информации, полученной в ходе оказания услуг по Договору.
					</p>
					<p className={style.text}>
						3.1.4. Информировать Заказчика о предполагаемых изменениях и
						последствиях, которые могут возникнуть у Заказчика в ходе или в
						результате оказания услуг, если таковые изменения и последствия
						предвидятся Исполнителем.
					</p>
					<p className={style.text}>
						3.1.5. Привлекать к оказанию услуг персонал, отвечающий требованиям
						квалификации, специализации оказываемых Исполнителем услуг по сути
						предмета договора.
					</p>
					<p className={style.text}>
						3.1.6.Осуществлять контроль выполнения услуги в сроке и объемах,
						установленных Договором.
					</p>
					<p className={style.text}>
						3.1.7.Устранять своевременно, но не более чем в течение двух суток
						(кроме установленных Правительством РФ праздничных дней, а также
						субботы и воскресенья), недостатки в оказываемых услугах, указанные
						в предъявленных Заказчиком и принятых Исполнителем претензиях.
					</p>
					<p className={cn(style.text, style.bold)}>3.2. Исполнитель вправе:</p>
					<p className={style.text}>
						3.2.1. Требовать оплату за оказанную(ые) услугу(и).
					</p>
					<p className={style.text}>
						3.2.2. Запрашивать и получать информацию, документы, необходимые для
						оказания услуг. В случае, если оказание услуг невозможно без
						предоставления Заказчиком необходимой документации и (или)
						информации, при не предоставлении Заказчиком необходимой
						документации и (или) информации Исполнитель вправе приостановить
						оказание услуг с одновременным уведомлением Заказчика до получения
						необходимой ему документации.
					</p>
					<p className={style.text}>
						3.2.3. Привлекать к оказанию услуг граждан Российской Федерации,
						граждан стран Таможенного союза, иных иностранных граждан, имеющих
						право осуществления трудовой деятельности на территории Российской
						Федерации, в том числе осуществляющих трудовую деятельность в иных
						организациях, на основании агентского договора, субподряда, иного
						договора с такими организациями.
					</p>
					<p className={cn(style.text, style.bold)}>3.3. Заказчик обязуется:</p>
					<p className={style.text}>
						3.3.1. Предоставить Исполнителю всю необходимую для оказания услуг
						информацию и документы.
					</p>
					<p className={style.text}>
						3.3.2. Организовать необходимые условия для эффективной работы
						Исполнителя (место, инвентарь). Предоставить инвентарь и расходные
						материалы, необходимые для оказания услуг по настоящему Договору,
						находящиеся в исправном состоянии. Использование инвентаря и
						расходных материалов в стоимость услуг не включаются.
					</p>
					<p className={style.text}>
						3.3.3. Обеспечивать Исполнителю беспрепятственный допуск на объекты
						Заказчика в период оказания услуг Договору.
					</p>
					<p className={style.text}>
						3.3.4. Принять и оплатить оказанные услуги в соответствии с
						условиями настоящего договора.{' '}
					</p>
					<p className={style.text}>
						3.3.5. В случае уменьшения или увеличения объема услуг, уведомлять
						об этом Исполнителя с указанием планируемого объема услуг в срок не
						позднее, чем за 5 (пять) дней до даты уменьшения/увеличения объема
						услуг.
					</p>
					<p className={style.text}>
						3.3.6. Обеспечить допуск на объект Заказчика персонала, указанного
						Исполнителем.
					</p>
					<p className={style.text}>
						3.3.7. Не поручать Исполнителю, персоналу и контрагентам Исполнителя
						выполнения видов работ, связанных с получением специального
						разрешения, лицензии, работ, а также требующих вступления в СРО без
						согласования с Исполнителем. Не поручать Исполнителю, персоналу
						Исполнителя других видов услуг, кроме согласованных в Приложении №1
						и в оплаченных счетах на оказание услуг. Не поручать иностранному
						персоналу Исполнителя или его контрагентам оказания услуг, не
						указанных в разрешительных документах такого персонала или
						контрагентов.
					</p>
					<p className={cn(style.text, style.indent)}>
						Исполнителя осуществляет услуги на территории Заказчика,
						соответствующей требованиям действующего законодательства в сфере
						охраны труда. Специальная оценка условий труда производится
						Заказчиком. В случае поручения Заказчиком Исполнителю исполнения
						работ или оказания услуг, не согласованных Договором, а также
						требующих специального разрешения, Исполнитель не несет
						ответственность за решения Заказчика, в чем бы это не выразилось
					</p>
					<p className={style.text}>
						3.3.8. Ознакомить Исполнителя и его контрагентов с действующими на
						территории объекта Заказчика нормами и правилами, связанными с
						предметом оказания услуг. Обеспечить безопасность персонала
						Исполнителя на объектах Заказчика, норм охраны труда. Соблюдать
						стандарты санитарно-эпидемиологических норм, в том числе, выполнять
						обязательные нормы по вакцинации персонала.
					</p>
					<p className={style.text}>
						3.3.9. Оплатить оказанные услуги в размере, в сроки и в порядке,
						предусмотренном настоящим Договором.
					</p>
					<p className={cn(style.text, style.bold)}>3.4. Заказчик вправе:</p>
					<p className={style.text}>
						3.4.1. Требовать от Исполнителя качества выполнения оказываемой
						услуги.
					</p>
					<p className={style.text}>
						3.4.2. Вносить пожелания и предложения Исполнителю при оказании
						услуг.
					</p>
					<p className={style.text}>
						3.4.3. По мере необходимости требовать от Исполнителя оказания Услуг
						в месте, отличном от указанного в п. 2.2. Договора, при этом
						компенсируя документально подтвержденные расходы Исполнителя,
						которые Исполнитель понес в связи с изменением места оказания услуг
						по такому требованию. Место оказания услуг, размер указанных
						расходов и порядок их оплаты могут быть определены в дополнительном
						коммерческом предложении. В случае отсутствия дополнительных
						расходов Исполнителя, составление дополнительного коммерческого
						предложения не требуется.
					</p>
					<p className={cn(style.text, style.bold)}>
						4. Стоимость и порядок расчетов
					</p>
					<p className={style.text}>
						4.1. Стоимость оказываемых Исполнителем услуг определяется
						выставленным счетом.
					</p>
					<p className={style.text}>
						4.2. Заказчик оплачивает Услуги за первый месяц проведения работ
						(оказания услуг) в следующем порядке: до начала оказания
						Исполнителем услуг (предварительная 100 % оплата согласно Приложению
						№1). Предоплата по Договору, в случае отказа от Договора со стороны
						Заказчика по вине Заказчика или по иной инициативе Заказчика не
						связанной с виновными действиями Исполнителя возврату не подлежит.
					</p>
					<p className={cn(style.text, style.bold)}>
						5. Порядок сдачи-приемки услуг
					</p>
					<p className={style.text}>
						5.1. В случае оплаты Заказчиком услуг в порядке и в сроки,
						установленные Разделом 4 Договора, работы (услуги) произведенные или
						оказанные Исполнителем считаются оказанными надлежащим образом,
						принятыми (утвержденными) Заказчиком в полном объеме.
					</p>
					<p className={style.text}>
						5.2. В случае несогласия Заказчика с объемом и/или качеством
						оказанных услуг Сторонами применяются положения Раздела 9 Договора.
					</p>
					<p className={cn(style.text, style.bold)}>
						6. Срок действия договора
					</p>
					<p className={style.text}>
						6.1. Настоящий Договор действует 1 календарный год, а в части
						взаиморасчетов – до полного их завершения. При отсутствии претензий
						у Сторон по условиям Договора, договор пролонгируется на очередной
						год.
					</p>
					<p className={style.text}>
						6.2. Настоящий Договор может быть расторгнут:
					</p>
					<p className={style.text}>6.2.1. По письменному соглашению Сторон;</p>
					<p className={style.text}>
						6.2.2. Договор может быть изменен или досрочно расторгнут по
						письменному уведомлению любой из Сторон в одностороннем порядке с
						обязательным письменным уведомлением другой Стороны по адресу,
						указанному в Договоре. В случае направления другой Стороне
						уведомления об отказе от исполнения Договора письмом, днем
						расторжения Договора Стороны признают 10 (десятый) календарный день,
						исчисляемый с даты направления уведомления, указанной на штампе
						почтового отделения связи, подтверждающем прием корреспонденции к
						отправке вне зависимости от даты последующего вручения
						корреспонденции.
					</p>
					<p className={style.text}>
						6.2.3. Договор может быть изменен или досрочно расторгнут любой из
						Сторон в соответствии со ст. 310, ст. 450.1, ст. 451 Гражданского
						кодекса РФ, а также в иных случаях, предусмотренных
						законодательством РФ.
					</p>
					<p className={style.text}>
						6.2.4. Неоплата Заказчиком счета по Договору в течении 5 рабочих
						дней является основанием для расторжения Договора со стороны
						Исполнителя. Дополнительные уведомления при этом не направляются.
					</p>
					<p className={style.text}>
						6.2.5. В случае прекращения Договора Стороны обязаны завершить
						взаиморасчеты по всем обязательствам, возникшим до дня прекращения
						Договора. Прекращение договора не влечет прекращение имеющихся у
						сторон обязательств.
					</p>
					<p className={cn(style.text, style.bold)}>
						7. Ответственность сторон
					</p>
					<p className={style.text}>
						7.1. Штрафные санкции, иные меры санкционного характера, возникшие в
						ходе проверок контролирующих (надзорных) органов на объекте(-ах)
						Заказчика, накладываемые по результатам на Исполнителя ввиду
						фактического несоблюдения Заказчиком надлежащего контроля на
						объекте(-ах), а также несоблюдения иных требований законов, в том
						числе, связанных с предпринимательской (хозяйственной) деятельностью
						Заказчика на объекте(-ах) (санитарных и (или)
						технико-технологических норм, норм противопожарной безопасности,
						несоблюдения норм учетно-кассовой дисциплины; не применения, или
						применение с нарушениями ККТ, допуск к осуществлению субподрядчиков
						Исполнителя деятельности, на осуществление которой у них отсутствует
						право, подтвержденное разрешительными документами, перекладываются
						на Заказчика. Заказчик при получении от Исполнителя постановления,
						исполнительного листа, иного документа об оплате штрафа, с
						сопроводительным письмом об оплате, обязан в течение 3 (трех) суток
						(календарных дней) перечислить сумму штрафа по документу на счет
						Исполнителя, либо в кассу Исполнителя в полном объеме единовременно.
						Вопрос о зачете суммы штрафа на счет, либо в кассу Исполнителя по
						указанным обстоятельствам Заказчиком не оспаривается.
					</p>
					<p className={cn(style.text, style.indent)}>
						В случае неоплаты Заказчиком предъявленного штрафа (штрафов), иных
						мер санкционного характера, последствия неоплаты штрафа несет
						Заказчик. Получение Заказчиком постановления, исполнительного листа,
						иного документа об оплате штрафа, а также сопроводительного письма
						от Исполнителя об оплате Заказчиком признается надлежащим и не
						подлежащим оспариванию в случаях: 1) получения документов нарочным
						от курьера (или представителя); 2) по истечении 2-х дней с даты
						поступления почтового отправления в отделение почты по адресу
						Заказчика, указанному в Договоре; 3) посредством электронной почты
						или иного средства электронной связи (направляется сканированный
						документ, т.е. копия, приравненная к оригиналу) по адресу Заказчика
						указанному в реквизитах настоящего Договора, либо на официальном
						сайте Заказчика или полученному иным способом поступления
						информации.
					</p>
					<p className={cn(style.text, style.indent)}>
						Заказчик имеет право и до получения от Исполнителя постановления,
						исполнительного листа, иного документа об оплате штрафа(-ов), иных
						мер санкционного характера оплатить штраф, о чем предоставляет
						Исполнителю документальное подтверждение. Заказчик несет полную
						административную ответственность за нарушения, указанные в п. 7.1.,
						п. 3.3.9.
					</p>
					<p className={style.text}>
						Заказчик имеет право и до получения от Исполнителя постановления,
						исполнительного листа, иного документа об оплате штрафа(-ов), иных
						мер санкционного характера оплатить штраф, о чем предоставляет
						Исполнителю документальное подтверждение. Заказчик несет полную
						административную ответственность за нарушения, указанные в п. 7.1.,
						п. 3.3.9., п. 3.3.12.
					</p>
					<p className={style.text}>
						7.2. Исполнитель не несёт ответственности за ущерб, причиненный
						имуществу Заказчика или имуществу третьих лиц, находящемуся у
						Заказчика. К ответственности за данный ущерб могут быть привлечены
						непосредственно лица, оказывающие услуги от имени Исполнителя,
						согласно действующему законодательству РФ.
					</p>
					<p className={cn(style.text, style.bold)}>
						8. Обстоятельства непреодолимой силы
					</p>
					<p className={style.text}>
						8.1. Стороны освобождаются от ответственности за частичное или
						полное неисполнение своих обязательств по настоящему Договору, если
						их исполнению препятствует чрезвычайное и непредотвратимое при
						данных условиях обстоятельство (непреодолимая сила, форс-мажор).
					</p>
					<p className={style.text}>
						8.2. При возникновении обстоятельств непреодолимой силы,
						препятствующих исполнению обязательств по настоящему Договору одной
						из Сторон, она обязана оповестить другую Сторону не позднее 10
						(десяти) календарных дней с момента возникновения таких
						обстоятельств, при этом срок выполнения обязательств по настоящему
						Договору переносится соразмерно времени, в течение которого
						действовали такие обстоятельства.
					</p>
					<p className={style.text}>
						8.3. При продолжительности обстоятельств непреодолимой силы более 30
						(тридцати) календарных дней, любая Сторона имеет право расторгнуть
						настоящий Договор без возмещения возможных убытков, при этом
						Заказчик обязан оплатить работы, выполненные Исполнителем к моменту
						наступления обстоятельств непреодолимой силы, если эти работы уже
						были выполнены в соответствии с условиями настоящего Договора.
					</p>
					<p className={style.text}>
						8.4. Надлежащим доказательством наличия указанных выше обстоятельств
						и их продолжительности будет служить документ, выдаваемый
						соответствующими компетентными органами, обладающий реквизитами
						официального документа в виде оригинала, либо надлежащим образом
						заверенной копии документа с обозрением оригинала документа.
					</p>
					<p className={cn(style.text, style.bold)}>9.Разрешение споров</p>
					<p className={style.text}>
						9.1. Все споры и разногласия, которые могут возникнуть между
						Сторонами, будут разрешаться путем переговоров. Стороны установили
						обязательный досудебный претензионный порядок разрешения споров.
						Срок рассмотрения каждой из Сторон письменной претензии другой
						Стороны не должен превышать 10 (десяти) рабочих дней с момента её
						получения. Письменная претензия направляется посредством почтового
						отправления либо передачи курьером под расписку другой Стороне
					</p>
					<p className={style.text}>
						9.2. При неурегулировании в процессе переговоров спорных вопросов,
						все споры разрешаются в Мировом Третейском Суде Союза поддержки и
						развития предпринимательства (ОГРН 1247800091505 ИНН 7842224910 КПП
						784245001). Стороны договорились, что решение Мирового Третейского
						Суда Союза поддержки и развития предпринимательства окончательно и
						обжалованию не подлежит.
					</p>
					<p className={cn(style.text, style.bold)}>
						10. Заключительные положения
					</p>
					<p className={style.text}>
						10.1. Настоящий Договор размещен на ресурсе {url} в сети интернет и
						не требует отдельного подписания.
					</p>
					<p className={style.text}>
						10.2. Все изменения и дополнения к настоящему Договору оформляются
						письменно и вступают в силу с момента их подписания уполномоченными
						представителями Сторон.
					</p>
					<p className={style.text}>
						10.3. Все приложения к настоящему Договору являются его неотъемлемой
						частью.
					</p>
					<p className={style.text}>
						10.4. Все дополнительные соглашения к настоящему Договору являются
						его неотъемлемой частью.
					</p>
					<p className={style.text}>
						10.5. Стороны соглашаются, что за исключением сведений, которые в
						соответствии с законодательством Российской Федерации не могут
						составлять коммерческую тайну юридического лица, содержание
						Договора, а также все документы, переданные Сторонами друг другу в
						связи с Договором, считаются конфиденциальными и относятся к
						коммерческой тайне Сторон, которая не подлежит разглашению без
						письменного согласия другой Стороны.
					</p>
					<p className={style.text}>
						10.6. По настоящему Договору Стороны гарантируют, что преследуют
						деловую цель и отражают операции в рамках исполнения настоящего
						Договора в соответствии с их экономическим смыслом в бухгалтерской и
						налоговой отчетности.
					</p>
					<p className={style.text}>
						10.7. Об изменении адресов и банковских реквизитов Стороны обязаны
						уведомлять друг друга в течение 3 (трех) рабочих дней с момента
						такого изменения. Исполнение противоположной Стороной обязательств
						на основе реквизитов до соответствующего уведомления об их изменении
						считается надлежащим.
					</p>
					<p className={style.text}>
						10.8. Стороны гарантируют, что не участвуют в судебных
						разбирательствах по заявлению о признании данной Стороны банкротом,
						не имеется оснований для финансовой несостоятельности (банкротства)
						данной Стороны и/или иных обстоятельств, препятствующих надлежащему
						исполнению обязательств по настоящему Договору.
					</p>
					<p className={style.text}>
						10.9. Стороны не имеют никаких сопутствующих устных договоренностей.
						Содержание текста Договора полностью соответствует действительному
						волеизъявлению сторон.
					</p>
				</div>
				<div className={style.btn}>
					<Button href={pdfData} type='primary' download>
						Скачать документ
					</Button>
				</div>
			</Card>
		</div>
	);
};

export default OnlineContractUshakov;
