// Договор аренды
import React from 'react';
import cn from 'classnames';
import { Card, Button } from 'antd';
import style from './OnlineContract.module.scss';
import LogoFrame from './LogoFrame';

const OnlineRentContract = ({ pdfData }) => {
	return (
		<div className={style.container}>
			<Card>
				<div className={style.wrapper}>
					<LogoFrame />
					<h1 className={style.title}>
						договор оферты аренды объекта недвижимости
					</h1>
					<p className={cn(style.text, style.bold)}>1. Общие положения.</p>
					<p className={style.text}>
						1.1.Настоящий договор (далее – «Договор») представляет собой
						официальное предложение ИП Жиурис Артур Витович, далее именуемое
						«Арендодатель», по предоставлению физическим и юридическим лицам,
						индивидуальным предпринимателям без образования юридического лица,
						признаваемыми «Арендатором» в соответствии с условиями Договора.
					</p>
					<p className={style.text}>
						1.2.В соответствии с пунктом 1 статьи 435 Гражданского кодекса
						Российской Федерации (далее – ГК РФ) данный документ является
						простой непубличной Офертой. Акцепт Оферты производится путем оплаты
						первого платежа по графику платежей представленному Арендодателем. В
						случае оплаты первого платежа согласно Приложению №1, выставленному
						Арендодателем, лицо, осуществившее Акцепт настоящей Оферты,
						становится Арендатором. Существенные условия Договора содержатся в
						самом Договоре и приложениях к нему.
					</p>
					<p className={style.text}>
						1.3.Договор считается заключенным, а все его существенные условия
						согласованными с момента оплаты первого платежа по Договору.
					</p>
					<p className={style.text}>
						1.4. В соответствии с пунктом 1 статьи 438 ГК РФ Акцепт является
						полным и безоговорочным.
					</p>
					<p className={style.text}>
						1.5. В соответствии с пунктом 3 статьи 438 ГК РФ совершение лицом,
						получившим Оферту, в срок, установленный для ее акцепта (3 рабочих
						дня), действий по выполнению указанных в ней условий Договора
						считается акцептом настоящей Оферты.
					</p>
					<p className={style.text}>
						1.6. Арендатор и Арендодатель предоставляют взаимные гарантии своей
						право- и дееспособности, необходимые для заключения и исполнения
						настоящего Договора.
					</p>
					<p className={style.text}>
						1.7. Заявка на заключение Договора и получение графика платежей
						направляется, лицом, желающим осуществить Акцепт настоящей Оферты на
						электронную почту <strong>arenda@archicrm.ru</strong> с указанием в
						такой заявке реквизитов Арендатора, предусмотренных ст. 19, ст. 54,
						ст. 1473 ГК РФ, а также контактного телефона и адреса электронной
						почты Арендатора для направления счетов, и иных уведомлений. В ответ
						на заявку, лица, желающего осуществить Акцепт настоящей Оферты
						Арендодателем или лицом, представляющим интересы Арендодателя,
						направляется Приложение №1 к Договору для оплаты аренды Помещения.
					</p>
					<p className={style.text}>
						1.8. Все юридически значимые сообщения по заключению Договора
						передаются путем обмена сообщениями через электронную почту{' '}
						<strong>arenda@archicrm.ru</strong> и электронной почте Арендатора,
						указанной им в порядке, установленном п. 1.7. Договора. Юридически
						значимые сообщения влекут последствия для Сторон с момента доставки
						таких сообщений.
					</p>
					<p className={style.text}>
						1.9. Стороны договорились, что фотографии и видеозаписи, на которых
						можно установить место и время съемки, будут являться надлежащим
						доказательством возникновения обстоятельств, на наличие которых
						будут ссылаться Стороны при урегулировании конфликтов.
					</p>
					<p className={style.text}>
						1.10. Арендодатель вправе осуществлять свои полномочия по настоящему
						Договору непосредственно или через иных лиц, которые вправе
						осуществлять все права Арендодателя от своего имени в интересах
						Арендодателя. Документы подтверждающие полномочия на представление
						иными лицами интересов Арендодателя размещаются в электронной форме
						по адресу: <strong>https://archicrm.ru/arenda</strong>. В случае
						изменения представителя Арендодателя уведомление о таком изменении
						направляется Арендатору на адрес электронной почты, указанный в
						заявке на заключение Договора.
					</p>
					<p className={cn(style.text, style.bold)}>
						2. Срок аренды. Расторжение договора.
					</p>
					<p className={style.text}>
						2.1. Помещение передается в аренду на срок до первого числа
						следующего месяца с даты заключения договора. Далее срок аренды
						исчисляется с первого числа по первое число следующего месяца в
						месяцах. Срок аренды продлевается ежемесячно путем оплаты арендной
						платы согласно Приложению №1, но не более чем на 11 месяцев с даты
						заключения Договора. Датой начала срока аренды считается дата
						заключения Договора
					</p>
					<p className={style.text}>
						2.2. Расторжение договора производится путем подписания соглашения.
						В случае нарушения Арендатором условий Договора, Арендодатель вправе
						расторгнуть Договор в одностороннем порядке без уведомления
						Арендатора.
					</p>
					<p className={style.text}>
						2.3. О расторжении Договора по инициативе Арендатора, Арендатор
						обязан предупредить Арендодателя не позднее чем за 30 календарных
						дней до даты расторжения. Невыполнение указанного требования влечет
						наложение на Арендатора штрафа в размере 50% от суммы
						обеспечительного платежа по Договору в порядке, который взыскивается
						путем удержания Арендодателем соответствующей суммы из
						обеспечительного платежа.
					</p>
					<p className={style.text}>
						2.4. О расторжении Договора по инициативе Арендодателя при
						отсутствии нарушений Договора со стороны Арендатора, арендодатель
						уведомляет Арендатора за 30 календарных дней.
					</p>
					<p className={cn(style.text, style.bold)}>
						3. Платежи и расчеты по договору. Изменение размера арендной платы.
					</p>
					<p className={style.text}>
						3.1. Платежи осуществляются на основании Приложения №1 к Договору.
						Приложение №1 является неотъемлемой частью Договора и включает в
						себя сведения о местонахождении и иных характеристиках Помещения,
						реквизиты расчетного счета Арендодателя для внесения платы по
						Договору, размер и сроки арендной платы платежей по Договору,
						реквизиты сторон Договора.
					</p>
					<p className={style.text}>
						3.1.1. Стоимость аренды определяется Арендодателем и отражается в
						Приложении №1 направленном Арендатору на указанный в заявке адрес
						электронной почты. Арендная плата вносится в размере и в сроки,
						указанные в Приложении №1 Арендатором не позднее 27-го числа месяца,
						перед оплачиваемым месяцем в формате 100% предоплаты за будущий
						месяц. Нарушения сроков внесения арендной платы более чем на 3
						календарных дня может являться основанием для расторжения Договора
						Арендодателем в одностороннем порядке без уведомления Арендатора.
					</p>
					<p className={style.text}>
						3.1.2. Стороны могут согласовать иные, не запрещенные
						законодательством РФ, порядок и условия арендной платы путем
						заключения дополнительного соглашения.
					</p>
					<p className={style.text}>
						3.1.3.Размер арендной платы может быть изменен по соглашению сторон
						(не чаще одного раза в год).
					</p>
					<p className={style.text}>
						3.1.4. Обеспечительный платеж в размере 100% стоимости аренды за
						полный месяц вносится Арендатором в день подписания Договора на
						основании Приложения №1.
					</p>
					<p className={style.text}>
						3.1.5.Обеспечительный платеж обеспечивает выполнение Арендатором
						обязательств по обеспечению сохранности имущества Арендодателя и
						выполнения иных условий Договора. В случае нанесения вреда имуществу
						либо его гибели Арендодатель получает право полностью, либо в части
						зачесть обеспечительный платеж в счет возмещения причиненного
						ущерба.
					</p>
					<p className={cn(style.text, style.bold)}>3.2. Прочие платежи.</p>
					<p className={style.text}>
						3.2.1. Стоимость коммунальных услуг не включена в арендную плату и
						оплачивается Арендатором отдельно на основании поступивших счетов на
						оплату от организаций, осуществляющих коммунальное обслуживание
						Помещения не позднее одного рабочего дня с момента поступления таких
						счетов. Сведения об оплате счетов направляются Арендодателю в виде
						платежных поручений или иных подтверждающих документов не позднее
						одного рабочего дня с момента оплаты на адрес электронной почты,
						указанный в Приложении №1.
					</p>
					<p className={style.text}>
						3.2.2. Стоимость услуг ресурсоснабжающих организаций не включена в
						арендную плату и оплачивается Арендатором отдельно на основании
						поступивших счетов на оплату от ресурсоснабжающих организаций не
						позднее одного рабочего дня с момента поступления таких счетов.
						Сведения об оплате счетов направляются Арендодателю в виде платежных
						поручений или иных подтверждающих документов не позднее одного
						рабочего дня с момента оплаты на адрес электронной почты, указанный
						в Приложении №1.
					</p>
					<p className={cn(style.text, style.bold)}>
						4. Предоставление и возврат Помещения.
					</p>
					<p className={style.text}>4.1. Предоставление Помещения</p>
					<p className={style.text}>
						4.1.1. Арендатору не передаются документы, относящиеся к имуществу.
					</p>
					<p className={style.text}>
						4.1.2. Обязательство Арендодателя по передаче имущества считается
						исполненным после предоставления его во владение Арендатору и
						подписания сторонами документа о передаче. Документом о передаче
						имущества является Договор, датой передачи имущества является дата
						подписания Договора. Имущество передается Арендатору в состоянии
						чистовой отделки с подключенными санузлами, электроснабжением,
						освещением, отоплением, водоснабжением и водоотведением (далее –
						Оборудование).
					</p>
					<p className={style.text}>
						4.2. Возврат Помещения производится на основании соглашения о
						расторжении Договора.
					</p>
					<p className={style.text}>
						4.2.1. В случае если Арендатором допущена порча или утрата
						оборудования, находящегося в помещении, порча внутренней отделки
						помещения, иные повреждения помещения, в том числе препятствующие
						использованию помещения, а также причинение Арендатором ущерба
						общедомовому имуществу, Арендодателем составляется Акт с указанием
						всего причиненного Арендатором ущерба. Акт составляется в письменной
						форме и не требует подписания Арендатором. Стороны договорились, что
						приложением к Акту являются файлы фото- и видеофиксации состояния
						Помещения при заключении Договора и при его расторжении,
						направленные на электронную почту в порядке п. 1.7. Договора.
					</p>
					<p className={style.text}>
						4.2.2. В случае, если Арендатором допущена порча или утрата
						оборудования, находящегося в помещении, порча внутренней отделки
						помещения, иные повреждения помещения, в том числе препятствующие
						использованию помещения, а также причинение Арендатором ущерба
						общедомовому имуществу, Арендодатель вправе потребовать у Арендатора
						устранения всех повреждений и восстановления имущества и
						оборудования, находящегося в Помещении, восстановления поврежденной
						отделки Помещения и ущерба, причиненного общедомовому имуществу. В
						случае невозможности со стороны Арендатора или отказа Арендатора в
						устранении всех повреждений имущества и оборудования, находящегося в
						Помещении, восстановлении поврежденной отделки Помещения и ущерба,
						причиненного общедомовому имуществу, возникших по вине Арендатора,
						Арендодатель вправе самостоятельно произвести восстановление
						поврежденного или утраченного оборудования, восстановление
						поврежденного имущества, а также восстановление поврежденной отделки
						Помещения. При этом стоимость ремонта и восстановления имущества,
						оборудования и внутренней отделки Помещения возмещается Арендатором
						не позднее 3 (трех) рабочих дней с момента предъявления
						Арендодателем уведомления в порядке, установленном п. 1.8. Договора,
						с расчетом стоимости восстановительных работ.
					</p>
					<p className={style.text}>
						4.2.3. Арендодатель вправе требовать от Арендатора возмещения
						убытков, возникших по причине невозможности использования Помещения
						в результате восстановления отделки помещения, устранения
						неисправностей оборудования и прочих повреждений Помещения,
						возникших по вине Арендатора. Размер убытков определяется в
						соответствии со ст. 15 ГК РФ из расчета стоимости договора аренды в
						пересчете на количество календарных дней, в течение которых
						Арендодатель не использовал Помещение по формуле{' '}
						<strong>У = Д/30 * К</strong>, где У – сумма убытков, подлежащих
						возмещению, Д – сумма договора за 1 календарный месяц, К –
						количество дней невозможности использования помещения. Убытки должны
						быть возмещены Арендатором не позднее трех рабочих дней с момента
						предъявления Арендодателем в порядке п. 1.7. Договора, уведомления с
						расчетом размера таких убытков.
					</p>
					<p className={cn(style.text, style.bold)}>
						5. Пользование имуществом. Передача имущества и арендных прав
						третьим лицам.
					</p>
					<p className={style.text}>
						5.1. В силу п. 2 ст. 615 ГК РФ Арендатор не вправе без согласия
						Арендодателя сдавать имущество в субаренду, предоставлять имущество
						в безвозмездное пользование, передавать свои права и обязанности по
						Договору другому лицу (перенаем).
					</p>
					<p className={style.text}>
						5.2. Арендатор не вправе использовать Помещение в целях, заведомо
						влекущих нарушение закона и права третьих лиц. Арендодатель не несет
						ответственности за ущерб, причиненный третьим лицам в результате
						противоправных действий Арендатора
					</p>
					<p className={cn(style.text, style.bold)}>
						6. Содержание и улучшение имущества.
					</p>
					<p className={style.text}>
						6.1. Для надлежащей эксплуатации помещения Арендодатель обеспечивает
						помещение следующими коммунальными услугами (освещением, отоплением,
						водоснабжением и водоотведением).
					</p>
					<p className={style.text}>
						6.2. Арендатор за свой счет должен содержать имущество в надлежащем
						санитарном состоянии, в том числе осуществлять уборку и выполнять
						иные необходимые санитарные работы, обеспечивать соблюдение
						санитарных норм и правил.
					</p>
					<p className={style.text}>
						6.3. Для поддержания имущества, его конструктивных элементов и
						оборудования в исправном состоянии Арендатор осуществляет
						техническое обслуживание находящихся в арендуемом помещении и
						смежных с ним помещениях, инженерных систем и оборудования в
						соответствии с эксплуатационной документацией, нормативными актами и
						условиями Договора. Виды работ по техническому обслуживанию, их
						объем, периодичность, сторона, определяются Арендодателем.
					</p>
					<p className={style.text}>
						6.4. Отделимые улучшения имущества, произведенные Арендатором,
						являются собственностью Арендодателя.
					</p>
					<p className={style.text}>
						6.5. Стоимость отделимых улучшений Арендатору не возмещается.
					</p>
					<p className={style.text}>
						6.6.Стоимость неотделимых улучшений имущества, произведенных
						Арендатором за счет собственных средств и с согласия Арендодателя,
						возмещению не подлежит.
					</p>
					<p className={style.text}>
						6.7. При возникновении необходимости произвести неотделимые
						улучшения имущества стороны согласовывают следующие условия их
						проведения: виды и объем работ, сроки производства работ.
						Согласование условий осуществляется путем направления уведомления в
						порядке п. 1.7. Договора одной из сторон. Если ответ на запрос о
						согласовании условий производства неотделимых улучшений не получен в
						течение 3 рабочих дней, такие условия считаются несогласованными.
					</p>
					<p className={style.text}>
						6.8. Перепланировка, переустройство или переоборудование помещения
						производятся только после их согласования сторонами, а также после
						получения необходимых разрешений (согласований) в установленном
						законом порядке. Согласование условий осуществляется путем
						направления уведомления в порядке п. 1.8. Договора одной из сторон.
						Если ответ на запрос о согласовании условий производства неотделимых
						улучшений не получен в течение 3 рабочих дней, такие условия
						считаются несогласованными
					</p>
					<p className={style.text}>
						6.9. Все согласования, необходимые для производства перепланировки,
						переустройства или переоборудования помещения, в органе, который
						согласовывает и выдает подтверждающие документы, осуществляет
						Арендодатель за свой счет.
					</p>
					<p className={cn(style.text, style.bold)}>
						7. Ответственность сторон.
					</p>
					<p className={style.text}>
						7.1. Каждая из сторон обязана возместить другой стороне убытки,
						причиненные неисполнением или ненадлежащим исполнением своих
						обязательств.
					</p>
					<p className={cn(style.text, style.bold)}>8. Изменение договора.</p>
					<p className={style.text}>
						8.1. Договор может быть изменен или расторгнут по соглашению сторон
					</p>
					<p className={cn(style.text, style.bold)}>9. Разрешение споров.</p>
					<p className={style.text}>
						9.1. Все споры и разногласия, которые могут возникнуть между
						Сторонами, будут разрешаться путем переговоров. Стороны установили
						обязательный досудебный претензионный порядок разрешения споров.
						Срок рассмотрения каждой из Сторон письменной претензии другой
						Стороны не должен превышать 10 (десяти) рабочих дней с момента её
						получения. Письменная претензия направляется посредством почтового
						отправления либо передачи курьером под расписку другой Стороне
					</p>
					<p className={style.text}>
						9.2. При неурегулировании в процессе переговоров спорных вопросов,
						все споры разрешаются в Мировом Третейском Суде Союза поддержки и
						развития предпринимательства (ОГРН 1247800091505 ИНН 7842224910 КПП
						784245001). Стороны договорились, что решение Мирового Третейского
						Суда Союза поддержки и развития предпринимательства окончательно и
						обжалованию не подлежит.
					</p>
					<p className={cn(style.text, style.bold)}>
						10. Заключительные положения.
					</p>
					<p className={style.text}>
						10.1. Документы (юридически значимые сообщения) направляются
						исключительно предусмотренными Договором способами. Направление их
						иным способом не может считаться надлежащим.
					</p>
					<p className={style.text}>
						10.2. Если иное не предусмотрено законом, все юридически значимые
						сообщения по Договору влекут для получающей их стороны наступление
						гражданско-правовых последствий с момента доставки соответствующего
						сообщения ей или её представителю. Сообщение считается доставленным
						и в тех случаях, если оно поступило лицу, которому оно направлено
						(адресату), но по обстоятельствам, зависящим от него, не было ему
						вручено или адресат не ознакомился с ним.
					</p>
					<p className={style.text}>
						10.3. Все приложения и дополнительные соглашения к Договору являются
						неотъемлемой его частью
					</p>
					<p className={style.text}>
						10.4. Договор размещен в электронной форме по адресу:{' '}
						<strong>https://archicrm.ru/arenda</strong>
					</p>
				</div>
				<div className={style.btn}>
					<Button href={pdfData} type='primary' download>
						Скачать документ
					</Button>
				</div>
			</Card>
		</div>
	);
};

export default OnlineRentContract;
