// ДОГОВОР-ОФЕРТА КОММЕРЧЕСКОЙ КОНЦЕСИИ (ФРАНЧАЙЗИНГА)
import React from 'react';
import cn from 'classnames';
import { Card, Button } from 'antd';
import style from './OnlineContract.module.scss';
import LogoFrame from './LogoFrame';

const OnlineFranchiseContract = ({ pdfData }) => {
	return (
		<div className={style.container}>
			<Card>
				<div className={style.wrapper}>
					<LogoFrame />
					<h1 className={style.title}>
						ДОГОВОР-ОФЕРТА КОММЕРЧЕСКОЙ КОНЦЕСИИ (ФРАНЧАЙЗИНГА)
					</h1>
					<p className={cn(style.text, style.bold)}>1. Общие положения.</p>
					<p className={style.text}>
						1.1.Настоящий договор (далее – «Договор») представляет собой
						официальное предложение{' '}
						<strong>
							Индивидуального предпринимателя Жиуриса Артура Витовича
						</strong>
						, далее именуемый «Правообладатель», по предоставлению юридическим
						лицам и индивидуальным предпринимателям без образования юридического
						лица, признаваемым «Пользователем» в соответствии с условиями
						Договора за вознаграждение право использовать в предпринимательской
						и/или иной, не запрещенной законом деятельности Пользователя,
						принадлежащие Правообладателю исключительные права, определенные в
						направляемом Пользователю Коммерческом предложении (Приложение №1 к
						Договору).
					</p>
					<p className={style.text}>
						1.2.Правообладатель и Пользователь для целей настоящего Договора
						далее совместно именуются «Стороны».
					</p>
					<p className={style.text}>
						1.3.В соответствии с пунктом 1 статьи 435 Гражданского кодекса
						Российской Федерации (далее – ГК РФ) данный документ является
						простой Офертой. Акцепт Оферты производится путем оплаты счета,
						выставленного Правообладателем. В случае оплаты услуг
						Правообладателя по счету, выставленному Правообладателем, лицо,
						осуществившее Акцепт настоящей Оферты, становится Пользователем.
						Существенные условия Договора содержатся в самом Договоре и
						приложениях к нему в виде Приложения №1 и счетов на оплату,
						выставляемых Правообладателем.
					</p>
					<p className={style.text}>
						1.5.Настоящий договор считается подписанным с момента оплаты первого
						счета по Договору.
					</p>
					<p className={style.text}>
						1.4.В соответствии с пунктом 1 статьи 438 ГК РФ Акцепт должен быть
						полным и безоговорочным
					</p>
					<p className={style.text}>
						1.5.В соответствии с пунктом 3 статьи 438 ГК РФ совершение лицом,
						получившим Оферту, в срок, установленный для ее акцепта (5 рабочих
						дней), действий по выполнению указанных в ней условий Договора,
						считается акцептом настоящей Оферты. В случае выполнения акцептантом
						оплаты после истечения срока, указанного в п. 1.5 Договора, право
						признания оферты, акцептованной остается за оферентом и выражается
						путем осуществления или принятия исполнения по Договору.
					</p>
					<p className={style.text}>
						1.6.Правообладатель и Пользователь предоставляют взаимные гарантии
						своей право- и дееспособности, необходимые для заключения и
						исполнения Договора.
					</p>
					<p className={style.text}>1.7.Термины</p>
					<p className={style.text}>
						- Договор коммерческой концессии – договор, заключаемый между
						Правообладателем и Пользователем, по которому одна сторона
						(Правообладатель) передает другой стороне (Пользователю) на
						определенных условиях право на использование Комплекса
						исключительных прав Правообладателя для организации и
						функционирования Предприятий.
					</p>
					<p className={style.text}>
						- Паушальный Взнос – единовременная фиксированная сумма, подлежащая
						выплате Правообладателю Пользователем
					</p>
					<p className={style.text}>
						- Периодические платежи – ежемесячные платежи, подлежащие выплате
						Правообладателю Пользователем за право использовать исключительные
						права, а также постоянное техническое и консультативное содействие,
						оказываемое Правообладателем Пользователю
					</p>
					<p className={style.text}>
						- Комплекс исключительных прав – объекты интеллектуальной
						собственности Правообладателя, включая Секреты производства
						(ноу-хау) и Товарный знак
					</p>
					<p className={style.text}>
						- Секреты производства (Ноу-хау) – принадлежащие Правообладателю
						сведения любого характера, которые имеют действительную и
						потенциальную коммерческую ценность в силу неизвестности их третьим
						лицам, к которым у третьих лиц нет свободного доступа на законном
						основании и в отношении которых Правообладателем введен режим
						коммерческой тайны. Правообладателю принадлежит исключительное право
						использования Секретов производства (Ноу-хау) любым, не
						противоречащим закону, способом. Секреты производства (Ноу-хау),
						принадлежащие Правообладателю, содержатся и передаются Пользователю
						в виде письменных документов, включая Руководство и Стандарты
					</p>
					<p className={style.text}>
						- Стандарты – письменная информация, предоставленная Пользователю
						Правообладателем, включающая, но не ограничивающая:
					</p>
					<p className={style.text}>
						• отличительные характеристики Предприятия, включая его
						оборудование, расстановку оборудования, Фирменную вывеску и внешний
						вид Предприятия в целом;
					</p>
					<p className={style.text}>
						• требования к Помещению Предприятия, включая его площадь и
						местонахождение;
					</p>
					<p className={style.text}>
						• способы использования Пользователем Комплекса исключительных прав;
					</p>
					<p className={style.text}>
						• иные требования, предъявляемые Правообладателем к Предприятию и
						направленные на обеспечение единообразия Фирменной сети.
					</p>
					<p className={style.text}>
						- Руководство – составленный Правообладателем в письменном виде свод
						обязательных для соблюдения Пользователем правил, инструкций и
						рекомендаций относительно функционирования Предприятия.
					</p>
					<p className={style.text}>
						- Товарный знак – товарный знак, выполненный согласно прилагаемой
						копии Свидетельства на товарный знак, зарегистрированный в
						Государственном реестре товарных знаков и знаков обслуживания РФ.
					</p>
					<p className={style.text}>
						- Фирменная сеть – совокупность предприятий, организация и
						функционирование которых связаны с использованием Комплекса
						исключительных прав, осуществляющих реализацию потребителям
						Продукции и Услуг.
					</p>
					<p className={style.text}>
						Конкурирующее предприятие – предприятие, реализующее товары и
						услуги, аналогичные Продукции и Услугам, реализуемым в предприятиях
						Фирменной сети.
					</p>
					<p className={style.text}>
						- Помещение – любой одобренный Правообладателем объект недвижимого
						имущества, в котором осуществляется или будет осуществляться
						коммерческая деятельность Пользователя, связанная с использованием
						Комплекса исключительных прав Правообладателя.
					</p>
					<p className={style.text}>
						- Продукция – товары, изготавливаемые согласно Стандартам
						Правообладателя и реализуемые в Пользователем.
					</p>
					<p className={style.text}>
						- Услуги – услуги, оказываемые Пользователем согласно Стандартам
						Правообладателя.
					</p>
					<p className={style.text}>
						- Фирменная вывеска – рекламная вывеска, размещенная снаружи
						Помещения Пользователя, с изображением Товарного знака
						Правообладателя.
					</p>
					<p className={style.text}>
						- Персонал – работники Пользователя, а именно физические лица,
						вступившие в трудовые отношения с Пользователем и признаваемые
						таковыми в соответствии с действующим законодательством РФ или в
						отношения на основании договоров гражданско-правового характера.
					</p>
					<p className={style.text}>
						- Обучение – проводимое Правообладателем обучение Персонала в
						области производства, реализации товаров и оказания услуг
						Пользователем.
					</p>
					<p className={cn(style.text, style.bold)}>
						2. Предмет и общие условия договора
					</p>
					<p className={style.text}>
						2.1.В соответствии с настоящим договором Правообладатель обязуется:
					</p>
					<p className={style.text}>
						- передать Пользователю техническую и коммерческую документацию и
						предоставить иную информацию, необходимую Пользователю для
						осуществления прав, предоставленных ему по Договору;
					</p>
					<p className={style.text}>
						- проинструктировать Пользователя и его работников по вопросам,
						связанным с осуществлением указанных прав;
					</p>
					<p className={style.text}>
						- обеспечить государственную регистрацию предоставления права
						использования в предпринимательской деятельности Пользователя
						принадлежащих Правообладателю исключительных прав по Договору;
					</p>
					<p className={style.text}>
						- оказывать пользователю постоянное техническое и консультативное
						содействие, включая содействие в обучении и повышении квалификации
						работников;
					</p>
					<p className={style.text}>
						- контролировать качество товаров и услуг, реализуемых и оказываемых
						Пользователем на основании Договора.
					</p>
					<p className={style.text}>2.2. Правообладатель имеет право:</p>
					<p className={style.text}>
						- на изменение, модернизацию или дополнение Секретов производства
						(Ноу-хау);
					</p>
					<p className={style.text}>
						- осуществлять контроль деятельности Пользователя согласно Договору;
					</p>
					<p className={style.text}>
						- открывать собственные предприятия с использованием своих
						исключительных прав;
					</p>
					<p className={style.text}>2.3. Пользователь обязан:</p>
					<p className={style.text}>
						- использовать при осуществлении предусмотренной Договором
						деятельности коммерческое обозначение, товарный знак, знак
						обслуживания и другие средства индивидуализации Правообладателя
						путем указания на товарах или их упаковках, вывесках,
						полиграфической продукции, в объявлениях и рекламе, в счетах и на
						иной документации;
					</p>
					<p className={style.text}>
						- обеспечивать соответствие качества реализуемых им товаров и
						оказываемых услуг качеству аналогичных товаров и услуг,
						производимых, реализуемых и оказываемых непосредственно
						Правообладателем;
					</p>
					<p className={style.text}>
						- согласовывать с Правообладателем место расположения коммерческих
						помещений, используемых при осуществлении предоставленных по
						Договору исключительных прав;
					</p>
					<p className={style.text}>
						- соблюдать инструкции и указания Правообладателя, направленные на
						обеспечение соответствия характера, способов и условий использования
						исключительных прав тому, как он используется Правообладателем, в
						том числе указания, касающиеся внешнего и внутреннего оформления
						коммерческих помещений, используемых Пользователем при осуществлении
						предоставленных ему по Договору прав;
					</p>
					<p className={style.text}>
						- оказывать покупателям (заказчикам) все дополнительные услуги, на
						которые они могли бы рассчитывать, приобретая (заказывая) товар
						(работу, услугу) непосредственно у Правообладателя;
					</p>
					<p className={style.text}>
						- не разглашать секреты производства (ноу-хау) Правообладателя и
						другую полученную от него конфиденциальную коммерческую информацию;
					</p>
					<p className={style.text}>
						- не использовать право пользования предоставленным ему
						исключительных прав на условиях субконцессии;
					</p>
					<p className={style.text}>
						- информировать покупателей (заказчиков) наиболее очевидным для них
						способом о том, что он использует коммерческое обозначение, товарный
						знак, знак обслуживания или иное средство индивидуализации в силу
						договора коммерческой концессии.
					</p>
					<p className={style.text}>
						- своевременно и в полном объеме производить оплату по Договору.
					</p>
					<p className={style.text}>2.4.Пользователь имеет право:</p>
					<p className={style.text}>
						- использовать исключительные права только при условии, что качество
						продукции и услуг будет не ниже, чем качество продукции и услуг
						Правообладателя;
					</p>
					<p className={style.text}>
						- использовать Товарный знак Правообладателя исключительно на
						Фирменной вывеске Предприятий, во внешнем и внутреннем оформлении
						Помещений Предприятий, в рекламных материалах и публикациях в СМИ,
						направленных на рекламирование предприятий, продукции и услуг,
						реализуемых Пользователем, на этикетках и ценниках, используемых с
						целью реализации продукции конечным потребителям, на
						сопроводительной и деловой документации, используемой в коммерческой
						деятельности, в сети Интернет, другими способами, письменно
						согласованными с Правообладателем.
					</p>
					<p className={cn(style.text, style.bold)}>
						3. Вознаграждение правообладателя
					</p>
					<p className={style.text}>
						3.1. Пользователь выплачивает Правообладателю вознаграждение в форме
						фиксированного паушального платежа, определенного Приложением №1 и
						периодических платежей в размере процентов отчислений от дохода
						Пользователя, установленных в Приложении №1, но не менее
						фиксированной суммы, установленной в Приложении №1, или
						фиксированной суммы, определенной в Приложении №1.
					</p>
					<p className={style.text}>
						3.2. Паушальный платеж выплачивается Пользователем на основании
						счета, выставляемого Правообладателем в сроки, указанные в п. 1.5.
						Договора.
					</p>
					<p className={style.text}>
						3.3. Имущественные права, передаваемые Пользователю, устанавливаются
						на основании Приложения №1 «Коммерческое предложение». Существенные
						условия Договора определяются в Приложении №1, которое
						согласовывается с Пользователем путем переговоров и направляются
						Правообладателем в любом удобном формате связи.
					</p>
					<p className={style.text}>
						3.4. Периодические платежи производятся Пользователем в период и
						сроки, установленные Приложением №1
					</p>
					<p className={cn(style.text, style.bold)}>4.Срок действия договора</p>
					<p className={style.text}>
						4.1.Договор начинает действовать с момента его акцепта в
						соответствии с п. 1.5 Договора. Срок действия Договора определяется
						Приложением №1.
					</p>
					<p className={style.text}>
						4.2. Срок Договора, определенный Приложением №1, пролонгируется на
						основании другого Приложения №1, содержащего иные сроки.
					</p>
					<p className={cn(style.text, style.bold)}>
						5.Изменение и прекращение Договора
					</p>
					<p className={style.text}>
						5.1.Договор может быть изменен только путем подписания нового
						Приложения №1.
					</p>
					<p className={style.text}>
						5.2.Новое Приложение №1 согласуется Сторонами путем переговоров.
						Действие Договора на момент согласования может быть приостановлено
						по решению Правообладателя.
					</p>
					<p className={style.text}>
						5.3.Договор может быть досрочно расторгнут любой из Сторон в
						соответствии со ст. 310, ст. 450.1, ст. 451 Гражданского кодекса РФ,
						а также в иных случаях, предусмотренных законодательством РФ.
					</p>
					<p className={style.text}>
						5.4.Неоплата Пользователем счета по Договору в течение 5 рабочих
						дней является основанием для расторжения Договора со стороны
						Правообладателя. Дополнительные уведомления при этом не
						направляются.
					</p>
					<p className={style.text}>
						5.5.В случае прекращения Договора Стороны обязаны завершить
						взаиморасчеты по всем обязательствам, возникшим до дня прекращения
						Договора. Прекращение договора не влечет прекращение имеющихся у
						Сторон обязательств.
					</p>
					<p className={cn(style.text, style.bold)}>6.Ответственность сторон</p>
					<p className={style.text}>
						6.1. Правообладатель не несет субсидиарную ответственность по
						предъявляемым к Пользователю требованиям о несоответствии качества
						товаров и услуг, продаваемых и оказываемых Пользователем по
						настоящему договору.
					</p>
					<p className={style.text}>
						6.2.Штрафные санкции, иные меры санкционного характера, возникшие в
						ходе проверок контролирующих (надзорных) органов на объекте(-ах)
						Пользователя, накладываемые по результатам на Правообладателя ввиду
						фактического несоблюдения Пользователем надлежащего контроля
						персонала на объекте(-ах), а также несоблюдения иных требований
						законов, в том числе, связанных с предпринимательской
						(хозяйственной) деятельностью Пользователя на объекте(-ах)
						(санитарных и (или) техникотехнологических норм, норм
						противопожарной безопасности, несоблюдения норм учетно-кассовой
						дисциплины; неприменения или применения с нарушениями ККТ, допуска
						работников к осуществлению трудовой деятельности, на осуществление
						которой у работников отсутствует право, подтвержденное
						разрешительными документами, перекладываются на Пользователя.
						Пользователь при получении от Правообладателя постановления,
						исполнительного листа, иного документа об оплате штрафа, с
						сопроводительным письмом об оплате, обязан в течение 3 (трех) суток
						(календарных дней) перечислить сумму штрафа по документу на счет
						Правообладателя, либо в кассу Правообладателя в полном объеме
						единовременно. Вопрос о зачете суммы штрафа на счет, либо в кассу
						Правообладателя по указанным обстоятельствам Пользователем не
						оспаривается.
					</p>
					<p className={cn(style.text, style.indent)}>
						В случае неоплаты Пользователем предъявленного штрафа (штрафов),
						иных мер санкционного характера, последствия неоплаты штрафа несет
						Пользователь. Получение Пользователем постановления, исполнительного
						листа, иного документа об оплате штрафа, а также сопроводительного
						письма от Правообладателя об оплате Пользователем признается
						надлежащим и не подлежащим оспариванию в случаях: 1) получения
						документов нарочным от курьера (или представителя); 2) по истечении
						2-х дней с даты поступления почтового отправления в отделение почты
						по адресу Пользователя, указанному в Договоре; 3) посредством
						электронной почты или иного средства электронной связи (направляется
						сканированный документ, т.е. копия, приравненная к оригиналу) по
						адресу Пользователя, указанному в Приложении №1, либо на официальном
						сайте Пользователя или полученному иным способом поступления
						информации.
					</p>
					<p className={style.text}>
						Пользователь имеет право и до получения от Правообладателя
						постановления, исполнительного листа, иного документа об оплате
						штрафа(-ов), иных мер санкционного характера оплатить штраф, о чем
						предоставляет Правообладателю документальное подтверждение.
						Пользователь несет полную административную ответственность за
						нарушения, указанные в п. 6.2.
					</p>
					<p className={style.text}>
						6.3. Правообладатель не несёт ответственности за ущерб, причиненный
						имуществу Пользователя или имуществу третьих лиц, находящемуся у
						Пользователя. К ответственности за данный ущерб могут быть
						привлечены непосредственно лица, оказывающие услуги от имени
						Пользователя, согласно действующему законодательству РФ.
					</p>
					<p className={style.text}>
						6.4. По требованиям, предъявляемым к Пользователю как изготовителю
						продукции (товаров) Правообладателя, Правообладатель отвечает
						солидарно с Пользователем.
					</p>
					<p className={style.text}>
						6.5. Пользователь несет субсидиарную ответственность за вред,
						причиненный Правообладателю действиями вторичных пользователей.
					</p>
					<p className={cn(style.text, style.bold)}>
						7. Обстоятельства непреодолимой силы
					</p>
					<p className={style.text}>
						7.1. Стороны освобождаются от ответственности за частичное или
						полное неисполнение своих обязательств по настоящему Договору, если
						их исполнению препятствует чрезвычайное и непредотвратимое при
						данных условиях обстоятельство (непреодолимая сила, форс-мажор).{' '}
					</p>
					<p className={style.text}>
						7.2.При возникновении обстоятельств непреодолимой силы,
						препятствующих исполнению обязательств по настоящему Договору одной
						из Сторон, она обязана оповестить другую Сторону не позднее 10
						(десяти) календарных дней с момента возникновения таких
						обстоятельств, при этом срок выполнения обязательств по настоящему
						Договору переносится соразмерно времени, в течение которого
						действовали такие обстоятельства.
					</p>
					<p className={style.text}>
						7.3.При продолжительности обстоятельств непреодолимой силы более 30
						(тридцати) календарных дней любая Сторона имеет право расторгнуть
						настоящий Договор без возмещения возможных убытков, при этом
						Пользователь обязан оплатить период до момента наступления
						обстоятельств непреодолимой силы, если в этот период Пользователь
						вел деятельность с использованием исключительных прав
						Правообладателя в соответствии с условиями Договора.
					</p>
					<p className={style.text}>
						7.4.Надлежащим доказательством наличия указанных выше обстоятельств
						и их продолжительности будет служить документ, выдаваемый
						соответствующими компетентными органами, обладающий реквизитами
						официального документа в виде оригинала, либо надлежащим образом
						заверенной копии документа с обозрением оригинала документа.
					</p>
					<p className={cn(style.text, style.bold)}>8.Разрешение споров</p>
					<p className={style.text}>
						8.1. Все споры и разногласия, которые могут возникнуть между
						Сторонами, будут разрешаться путем переговоров. Стороны установили
						обязательный досудебный претензионный порядок разрешения споров.
						Срок рассмотрения каждой из Сторон письменной претензии другой
						Стороны не должен превышать 10 (десяти) рабочих дней с момента её
						получения. Письменная претензия направляется посредством почтового
						отправления либо передачи курьером под расписку другой Стороне
					</p>
					<p className={style.text}>
						8.2. При неурегулировании в процессе переговоров спорных вопросов,
						все споры разрешаются в Мировом Третейском Суде Союза поддержки и
						развития предпринимательства (ОГРН 1247800091505 ИНН 7842224910 КПП
						784245001). Стороны договорились, что решение Мирового Третейского
						Суда Союза поддержки и развития предпринимательства окончательно и
						обжалованию не подлежит.
					</p>
					<p className={cn(style.text, style.bold)}>
						9.Заключительные положения
					</p>
					<p className={style.text}>
						9.1 Настоящий Договор размещен на ресурсе{' '}
						<strong>https://archicrm.ru/online/dogovora/ipzhiuris_kd</strong> в
						сети интернет и не требует отдельного подписания.{' '}
					</p>
					<p className={style.text}>
						9.2.Все изменения и дополнения к настоящему Договору оформляются
						письменно и вступают в силу с момента их подписания уполномоченными
						представителями Сторон.
					</p>
					<p className={style.text}>
						9.3.Все приложения к настоящему Договору являются его неотъемлемой
						частью.
					</p>
					<p className={style.text}>
						9.4.Стороны соглашаются, что за исключением сведений, которые в
						соответствии с законодательством Российской Федерации не могут
						составлять коммерческую тайну юридического лица, содержание
						Договора, а также все документы, переданные Сторонами друг другу в
						связи с Договором, считаются конфиденциальными и относятся к
						коммерческой тайне Сторон, которая не подлежит разглашению без
						письменного согласия другой Стороны.
					</p>
					<p className={style.text}>
						9.5.По настоящему Договору Стороны гарантируют, что преследуют
						деловую цель и отражают операции в рамках исполнения настоящего
						Договора в соответствии с их экономическим смыслом в бухгалтерской и
						налоговой отчетности.
					</p>
					<p className={style.text}>
						9.6.Об изменении адресов и банковских реквизитов Стороны обязаны
						уведомлять друг друга в течение 3 (трех) рабочих дней с момента
						такого изменения. Исполнение противоположной Стороной обязательств
						на основе реквизитов до соответствующего уведомления об их изменении
						считается надлежащим.
					</p>
					<p className={style.text}>
						9.7.Стороны гарантируют, что не участвуют в судебных
						разбирательствах по заявлению о признании данной Стороны банкротом,
						не имеется оснований для финансовой несостоятельности (банкротства)
						данной Стороны и/или иных обстоятельств, препятствующих надлежащему
						исполнению обязательств по настоящему Договору.
					</p>
					<p className={style.text}>
						9.8.Стороны не имеют никаких сопутствующих устных договоренностей.
						Содержание текста Договора полностью соответствует действительному
						волеизъявлению сторон.
					</p>
				</div>
				<div className={style.btn}>
					<Button href={pdfData} type='primary' download>
						Скачать документ
					</Button>
				</div>
			</Card>
		</div>
	);
};

export default OnlineFranchiseContract;
